betfair/templates/uk/BFExchangeService.getDetailAvailableMktDepth.req.xml

<?xmlversion='1.0'encoding='UTF-8'?>
<SOAP-ENV:Envelope
xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'
xmlns:SOAP-ENC='http://schemas.xmlsoap.org/soap/encoding/'
xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
xmlns:xsd='http://www.w3.org/2001/XMLSchema'
xmlns:ns2='http://www.betfair.com/publicapi/types/exchange/v5/'
xmlns:ns1='http://www.betfair.com/publicapi/v5/BFExchangeService/'>
<SOAP-ENV:Body>
<ns1:getDetailAvailableMktDepth>
<ns1:request>
<header>
<sessionToken></sessionToken>
</header>
<asianLineId>0</asianLineId>
<currencyCode></currencyCode>
<locale></locale>
<marketId>0</marketId>
<selectionId>0</selectionId>
<header>
<clientStamp>0</clientStamp>
<sessionToken></sessionToken>
</header>
</ns1:request>
</ns1:getDetailAvailableMktDepth>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
